{
  "_class_name": "ControlNetModel",
  "_diffusers_version": "0.20.0.dev0",
  "_name_or_path": "valhalla/d-n-a-fixed",
  "act_fn": "silu",
  "addition_embed_type": null,
  "addition_embed_type_num_heads": 64,
  "addition_time_embed_dim": 256,
  "attention_head_dim": 8,
  "block_out_channels": [
    256,
    512,
    1024,
    1024
  ],
  "class_embed_type": null,
  "conditioning_channels": 16,
  "conditioning_embedding_out_channels": [
    16,
    32,
    96,
    256
  ],
  "controlnet_conditioning_channel_order": "rgb",
  "cross_attention_dim": null,
  "down_block_types": [
    "CrossAttnDownBlock2D",
    "CrossAttnDownBlock2D",
    "CrossAttnDownBlock2D",
    "DownBlock2D"
  ],
  "mid_block_type": "UNetMidBlock2D",
  "downsample_padding": 1,
  "encoder_hid_dim": null,
  "encoder_hid_dim_type": null,
  "flip_sin_to_cos": true,
  "freq_shift": 0,
  "global_pool_conditions": false,
  "in_channels": 5,
  "layers_per_block": 2,
  "mid_block_scale_factor": 1,
  "norm_eps": 1e-05,
  "norm_num_groups": 32,
  "num_attention_heads": null,
  "num_class_embeds": null,
  "only_cross_attention": false,
  "projection_class_embeddings_input_dim": 2816,
  "resnet_time_scale_shift": "default",
  "transformer_layers_per_block": [
    0,
    0,
    0,
    0
  ],
  "upcast_attention": null,
  "use_linear_projection": true
}